Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: Small offices, day nurseries and suchlike are examples of work premises referred to in Section 83(2).
sv: Exempel på arbetslokal, som avses i 83 §, andra stycket, är mindre kontor, förskola o.d.

source: Read more about the requirements for attack alarms in the provisions about violence and threats.
sv: Läs mer om krav på överfallslarm i föreskrifterna om våld och hot.

source: It is important that the alarm signal for evacuation should be clearly identifiable.
sv: Det är viktigt att larmsignal för utrymning inte är förväxlingsbar.

source: In the event of a power failure, the alarm installation should be capable of remaining in working order for at least 60 minutes.
sv: Vid strömavbrott bör larmanläggningens funktion kunna upprätthållas under minst 60 minuter.

source: The type of alarm device needed will depend on the risk situation which can arise.
sv: Till 85 § Vilken typ av larmanordning som behövs beror på vilken risksituation som kan uppstå.

source: Very often a simple device is sufficient, e.g. manual call point, signal line and signalling device.
sv: I många fall räcker det med en enkel anordning, t.ex. larmknapp, signalledning och signaldon.

source: An evacuation alarm triggered automatically by a detector may be needed if a fire or escaping gas can mean acute danger to personnel, e.g. because a fire can easily develop and spread rapidly, because fumes from the fire quickly impede visibility or because escaping gas can quickly cause asphyxiation or poisoning.
sv: Utrymningslarm som utlöses automatiskt av detektor kan behövas om brand eller gasutströmning kan innebära akut fara för personalen, t.ex. därför att brand lätt får snabbt förlopp och spridning, för att brandgaserna snabbt försvårar sikten eller för att utströmmande gas snabbt kan orsaka kvävning eller förgiftning.

source: If there is an automatic fire alarm connected to a rescue service, this and the evacuation alarm referred to in the provisions can be coordinated where appropriate.
sv: Där det finns automatiskt brandlarm anslutet till räddningstjänst kan, där så är lämpligt, det automatiska brandlarmet och det utrymningslarm som avses i föreskrifterna samordnas.

source: An alarm signal must not always lead to immediate evacuation.
sv: Det är inte alltid så att larmsignal behöver leda till omedelbar utrymning.

source: In certain cases a simple, rapid contingency programme can reduce or eliminate the risks which could otherwise have arisen.
sv: I vissa fall kan ett enkelt och snabbt genomfört åtgärdsprogram minska eller helt eliminera de risker som annars kunnat uppstå.

source: Technical measures such as an automatic fixed extinguishing device to facilitate evacuation may be needed if, for example, large quantities of plastic, paint or paper are handled in the activity.
sv: Tekniska åtgärder såsom automatisk brandsläckningsanordning för att underlätta utrymning kan behövas där det i verksamheten hanteras t.ex. större mängder plast, färg eller papper.

source: Organisational measures in the form of a fire safety organisation and extra training for the personnel may be other ways of achieving this end.
sv: Organisatoriska åtgärder i form av en brandskyddsorga- nisation och extra utbildning av personalen kan vara andra sätt att uppnå målet.

source: Rules on this subject are contained in the provisions of the Work Environment Authority on systematic work environment management.
sv: Regler om detta finns i Arbetsmiljöverkets föreskrifter om systematiskt arbetsmiljöarbete.

source: When choosing the method to be taken, it is important to carefully evaluate the advantages and disadvantages of the various options in relation to the fire risk and personal safety.
sv: Vid valet av åtgärd är det viktigt att noga bedöma för- och nackdelarna med alternativen i förhållande till brandrisken och personsäkerheten.

source: The municipal rescue service must be consulted in these matters.
sv: Det är viktigt att i dessa frågor samråda med räddningstjänsten i kommunen.

source: An automatic fixed extinguishing device can be various types of sprinkler system with varying capacities for extinguishing or limiting the fire.
sv: Med automatisk brandsläckningsanordning avses olika typer av sprinklersystem med olika förmåga att släcka eller begränsa branden.

source: These systems provide either local, partial or complete protection.
sv: Systemen fungerar som punkt-, del- eller helskydd.

source: With an efficient, properly adapted sprinkler installation, however, the extinguishing process should begin quickly, thus increasing the possibility of extinguishing or limiting the fire and, accordingly, the safe evacuation of the building.
sv: En väl fungerande och anpassad sprinkleranläggning bör dock innebära att släckinsatsen kommer igång snabbt, vilket ökar möjligheten att släcka - eller begränsa en brand och därmed genomföra en trygg utrymning.

source: The longer the response time of the rescue service, the more important will the measures, both technical and organisational, taken inside the building or work premises be and they are particularly important for personal safety if the fire is expected to spread rapidly and extensively.
sv: Betydelsen av de i byggnaden eller arbetslokalen vidtagna åtgärderna, såväl tekniska som organisatoriska, ökar ju längre insatstid räddningstjänsten har, och är av särskilt stor betydelse för personsäkerheten om branden - bedöms kunna få snabb spridning och stor omfattning.

source: Guidelines for automatic water sprinkler installations have been published by the Swedish Fire Protection Association in SBF 120, "Regler för automatisk vattensprinkleranläggning" (Rules for automatic water sprinkler installation), which is adapted to the standard SS-EN 12845 "Automatiska sprinklersystem – utförande, installation och underhåll" (Automatic sprinkler systems – design, installation and maintenance).
sv: Riktlinjer för automatisk vattensprinkleranläggning finns utgivna av Svenska Brandskyddsföreningen i SBF 120, Regler för automatisk vatten- sprinkleranläggning som är anpassad till standarden SS-EN 12845 Automatiska sprinklersystem – utförande, installation och underhåll.

source: An installation of this kind is used in special cases, e.g. for a technical device where a fire can occur in a flammable product, in a space for a high voltage electrical installation or for a computer centre.
sv: Sådan släckanläggning används i speciella fall, t.ex. för teknisk anordning där brand kan uppstå i brandfarlig vara, i utrymme för elektrisk starkströmsanläggning eller för datacentral.

source: Guidelines on fixed carbon dioxide installations are published by the Swedish Fire Protection Association in SBF 115, "Regler för koldioxidsläckanläggning" (Rules for carbon dioxide extinguishing).
sv: Riktlinjer för koldioxidanläggning finns utgivna av Svenska Brandskydds- föreningen i SBF 115, Regler för koldioxidsläckanläggning.

source: The discharge of this kind of extinguishing agent should take place with a certain delay after the alarm, so that evacuation can take place before there is any acute risk of injury.
sv: Utlösningen av sådant släckmedel bör ske med viss fördröjning efter larmet, så att utrymning kan ske innan akut risk för skador uppstår.

source: Other measures are warning signs and instructions for work in a space where a carbon dioxide or other suitable extinguishing installation is present and for turning off this kind of extinguishing agent when work is being done on the extinguishing installation.
sv: Andra åtgärder är varningsskyltar och instruktioner för arbete i utrymme där koldioxid- eller annan lämplig släckanläggning finns och för blockering av sådant släckmedel när arbete pågår på släckanläggningen.

source: A common assembly point can with advantage be arranged for personnel who work together.
sv: Gemensam återsamlingsplats kan med fördel ordnas för personal som arbetar tillsammans.

source: This increases the possibilities of checking that everyone is present.
sv: Detta ökar möjligheterna att kontrollera att alla har kunnat återsamlas.

source: A specimen evacuation plan will be found in Swedish Standard SS 2875.
sv: Exempel på hur en utrymningsplan kan vara utformad finns i svensk standard SS 2875.

source: If several small firms are operating within the same building or within a limited area, there is nothing to prevent the employers providing communal personnel facilities, so long as the provisions are complied with.
sv: Om flera mindre företag har sin verksamhet inom en byggnad eller inom ett begränsat område, finns det inget som hindrar att arbetsgivarna tillhandahåller gemensamma personalutrymmen, förutsatt att föreskrifterna följs.

source: When personnel facilities are shared by several employers, this can necessitate special agreements concerning rules of conduct, cleaning etc.
sv: Då per- sonalrum är gemensamma för flera arbetsgivare kan detta innebära att det behövs särskilda överenskommelser för ordning, städning o.d.

source: Where the main activity is run by one employer and only a few people are employed by someone else, it may happen that everyone uses the same personnel facilities.
sv: Där en arbetsgivare driver den huvudsakliga verksamheten och endast ett fåtal arbetstagare har en annan arbetsgivare förekommer det att alla använder samma personalutrymmen.

source: At a bus terminal, for example, it can be practical for kiosk staff also to use the personnel facilities which are mainly intended for terminal employees.
sv: På t.ex. en bussterminal kan det vara praktiskt att även kioskpersonal använder personalutrymmen som främst är avsedda för de anställda vid terminalen.

source: The requirement that the positioning of personnel facilities be adapted to the nature of the work means among other things that it is generally acceptable for employees outdoors to have a longer distance to go to personnel facilities than employees indoors.
sv: Att personalutrymmenas placering ska vara anpassad till arbetets natur innebär bl.a. att det i allmänhet är acceptabelt att arbetstagare utomhus har längre avstånd till personalutrymmen än arbetstagare inomhus.

source: Moving within an extensive area is often part of the job, e.g. for a dockworker or park groundsman.
sv: Det ligger ofta i arbetsuppgiften för t.ex. en hamn- eller parkarbetare att röra sig inom ett vidsträckt område.

source: On the other hand, an extensive worksite may, owing to the number of employees, need to have more personnel facilities than are indicated in the various sections of these provisions and the guidance on them.
sv: Å andra sidan kan det inom ett vidsträckt arbetsställe behövas fler personalutrymmen med hänsyn till antalet arbetstagare än vad som anges under respektive avsnitt i dessa föreskrifter med kommentarer.

source: During work or service in a user's or patient's home, the employer may in some cases need to arrange personnel facilities outside the home.
sv: Vid arbete och tjänstgöring i en brukares eller omvårdnadstagares bostad kan arbetsgivaren i vissa fall behöva ordna med personalutrymmen utanför bostaden.

source: Work away from a permanent operating location can be of very varied character and duration.
sv: Arbete utanför ett fast driftsställe kan ha mycket varierande karaktär och varaktighet.

source: The same rules for personnel facilities apply, however, and irrespective of the working conditions it is important that the personnel facilities are as good as possible.
sv: Samma regler för personalutrymmen gäller dock och oavsett arbetsförhållandena är det angeläget att personalutrymmena är så bra som möjligt.

source: The possibilities of moving cabins, etc. and connecting electricity, water and drains vary from case to case however.
sv: Möjligheten att transportera bodar m.m. samt att ansluta el, vatten och avlopp varierar emellertid från fall till fall.

source: It is, of course, easier to arrange personnel facilities of a relatively high standard where work is carried out over a long period, and the workplace has good road connections than in a location where these prerequisites are lacking.
sv: Det är givetvis lättare att ordna personalutrymmen med relativt hög standard där arbete pågår under lång tid och arbetsplatsen har bra vägförbindelser, än där dessa förutsättningar saknas.

source: The fact of persons undergoing training or education being equated with employees for the purposes of these Provisions does not mean that this category will in every respect and in all training or educational activities have the same need of personnel facilities as employees in the undertaking.
sv: Det förhållandet att de som genomgår utbildning jämställs med arbetstagare vid tillämpningen av dessa föreskrifter innebär inte att denna kategori i alla hänseenden och i alla utbildningsverksamheter har samma behov av personalutrymmen som arbetstagarna i verksamheten.

source: Apart from the variations of work environment normally existing between different types of activity and workplace, there are also great variations within the education system regarding both the nature and duration of education and the confinement of pupils to the teaching premises.
sv: Förutom de variationer i arbetsmiljö som normalt finns mellan olika typer av verksamheter och arbetsplatser finns inom utbildningsväsendet också stora variationer i

source: The conditions applying, above all, to post-secondary students with a few lectures every week or with a limited amount of timetabled attendance are different from those applying to employees of universities and colleges.
sv: För framför allt högskolestuderande med ett fåtal föreläsningar i veckan eller med begränsad schemalagd närvaro gäller andra förutsättningar än de som gäller för arbetstagarna vid universitet och högskolor.

source: For professional education within the university sector, however, the same prerequisites normally apply for both the students and the employees.
sv: Vid yrkesutbildning inom högskoleområdet gäller däremot normalt samma förutsättningar för de studerande som för arbetstagarna.

source: Ways in which personnel facilities for workplaces away from a permanent worksite can be arranged are instanced in the table.
sv: Exempel på hur personalutrymmen för arbetsplatser utanför ett fast driftsställe kan ordnas finns i tabellen.

source: Prerequisites
sv: Förutsättningar

source: Examples of work
sv: Exempel på arbete

source: Personnel facility
sv: Personalutrymme

source: Work in the same place for a considerable length of time where it is reasonable to arrange electricity and water supply and drainage.
sv: Arbete på samma ställe under längre tid där det är rimligt att ordna anslutning till el, vatten och avlopp.

source: Building work.
sv: Byggnadsarbete.

source: In certain cases, roadwork and civil engineering on large construction workplaces
sv: I vissa fall väg- och anläggningsarbete på större arbetsplats.

source: Personnel cabins.
sv: Personalbodar.

source: Work in various places where the connection of water and drainage is not a reasonable proposition.
sv: Arbete på skiftande platser där det inte är rimligt att ansluta till vatten och avlopp.

source: Building work on small workplaces.
sv: Byggarbete på mindre arbetsplats.

source: Forestry work.
sv: Skogs- arbete.

source: Line work.
sv: Linjearbete.

source: Certain kinds of road- work.
sv: Vissa vägarbeten.

source: Work at a great distance from permanent personnel personnel facilities (in certain cases farm work and horticultural work).
sv: Arbete långt från fasta personalutrymmen (i vissa fall jordbruksarbete och trädgårdsarbete).

source: Personnel cabins adapted for movement on inferior roads or off- road.
sv: Personalbodar anpassade för att kunna föras fram på sämre vägar eller i terräng.

source: In exceptional cases, mainly during the summer season, a small caravan or suchlike.
sv: Undantagsvis och främst sommartid mindre rastvagn eller dylikt.

source: Work requiring employees to cover long distances during the day, sometimes off- road.
sv: Arbete där arbetstagare förflyttar sig längre sträckor under dagen, ibland i terräng.

source: Ambulatory work (service and stand-by work, etc.).
sv: Ambulerande arbete (service- och jour- arbete m.m.).

source: A vehicle fitted out with a dining space, washing facilities and perhaps some kind of portable toilet.
sv: Fordon som inretts med matplats, tvätt- möjlighet och någon typ av portabel toalett.

source: Personnel facilities at other worksites or suchlike.
sv: Personalutrymmen på andra arbetsställen eller dylikt.

source: When calculating the number of employees who may come to use a personnel facility, there are several factors to be considered.
sv: Vid beräkning av hur många arbetstagare som kan komma att använda ett personalutrymme är det flera faktorer som har betydelse.

source: One of them is the working hours at the worksite.
sv: En faktor är arbetstiderna på arbetsstället.

source: shift, if the teams do not normally need to use them simultaneously.
sv: AFS 2009:2

source: Note, however, that every employee needs an individual clothes locker, clothes compartment or some other suitable arrangement when the Provisions require separate spaces for private clothing and work clothing.
sv: arrangemang när föreskrifterna kräver skilda utrymmen för privata kläder och arbetskläder.

source: If the shifts go off duty and on duty in the changing rooms, this provision means that the rooms must be large enough for both shifts.
sv: Avlöser skiften varandra i omklädningsrummen innebär föreskriften att rummen behöver ha plats för båda lagen.

source: If personnel with a different employer are active at a worksite, this too can have a bearing on the size and number of personnel facilities.
sv: Om det på ett arbetsställe arbetar personal som har en annan arbetsgivare kan detta också ha betydelse för personalutrymmenas storlek och antal.

source: The question then is how often and how long non-employees work at the worksite.
sv: Frågan blir då hur ofta och hur länge icke anställd personal arbetar på arbetsstället.

source: Their working hours are also relevant.
sv: Även arbetstiderna för dessa inverkar.

source: Certain personnel facilities can often be needed for cleaning staff who are not employed by the employer using their services.
sv: Ofta kan vissa personalutrymmen behövas för städpersonal som inte är anställd hos den arbetsgivare där städning utförs.

source: At large worksites where maintenance of machinery and buildings is carried on continuously by personnel not employed at the worksite, personnel facilities are also needed for this group.
sv: På stora arbetsställen där underhåll av maskiner och byggnader utförs kontinuerligt av personal som inte är anställd på arbetsstället behövs personalutrymmen även för denna personalgrupp.

source: If, for example, security staff are employed at different hours from the regular personnel, extra personnel facilities for the security staff at the surveillance point can often be dispensed with.
sv: Om exempelvis bevakningspersonal arbetar på andra tider än den ordinarie personalen behövs ofta inga extra personalutrymmen för bevaknings- personalen på bevakningsstället.

source: The Equal Opportunities Act (SFS 1991:433) contains rules on measures to make working conditions suitable for both women and men.
sv: I diskrimineringslagen (SFS 2008:567) finns regler om åtgärder för att arbetsförhållanden ska lämpa sig för både kvinnor och män.

source: It is specifically prescribed that a chain saw room shall be provided for the care and storage of chain saws and fuel and shall be kept separate from personnel facilities.
sv: För vård och förvaring av motorsågar och drivmedel är det särskilt föreskrivet att motorsågsrum ska finnas och vara skilt från personalut- rymme.

source: See the provisions of the Work Environment Authority on the use of chain saws and bush saws.
sv: Se Arbetsmiljöverkets föreskrifter om användning av motorkedje- sågar och röjsågar.

source: One example of a situation where other activity does not impair use as a personnel facility is the use of a staff canteen for teaching or meetings at times when it is not being used for its main purpose.
sv: Exempel på när annan verksamhet inte försämrar användningen som personalutrymme är då personalmatsalen används som kurs- eller mötes- lokal på tider när den inte används för sitt ordinarie ändamål.

source: In schools, arrangements for the storage of valuables can vary, depending on school by-laws and the pupils’ need of safe storage for valuables.
sv: I skolan kan lösningarna för att förvara värdesaker variera beroende på skolans lokala regler och elevernas behov av att förvara värdesaker, läromedel och annan utrustning.

source: In a school, arrangements for the storage of the children’s outdoor clothing can vary, depending among other things on the pupils’ age.
sv: I en skola kan förvaringen av elevernas ytterkläder variera bl.a. beroende på elevernas ålder.

source: Outdoor clothing can be stored next to the classrooms, e.g. in the corridor, in pupils’ lockers or in a cloakroom.
sv: Förvaring av ytterkläder kan ske i anslutning till klass- rummen, t.ex. i elevskåp i korridoren eller i ett från korridoren avskilt kapprum.

source: If the location of a changing room or other cloakroom is such that the employees cannot remain indoors when proceeding to their workplace, hooks or suchlike for outdoor clothing are often needed in or near the workroom.
sv: Om ett omklädningsrum eller annat klädutrymme är så beläget att arbetstagarna inte kan gå inomhus till ett annat personalutrymme eller till sin arbetsplats, behövs ofta möjlighet att hänga upp ytterkläder i eller intill arbetslokalen eller personalutrymmet.

source: Special storage places for private clothing and work clothing can be arranged in a variety of ways.
sv: Skilda förvaringsplatser för privata kläder och arbetskläder kan ordnas på olika sätt.

source: Personal or civilian clothing used in connection with dirty, noisome or sudorific work is equated in this respect with work clothing.
sv: Privata kläder som används vid smutsande, illaluktande eller svettdrivande arbeten likställs i detta avseende med arbetskläder.

source: Segregation can be achieved, for example, with two clothes lockers, one clothes locker with a partition or a clothes locker for private clothing and an open clothes compartment for work clothing.
sv: Åtskillnaden kan åstadkommas med t.ex. två klädskåp, ett klädskåp med mellanvägg eller ett klädskåp för privata kläder och ett öppet klädfack för arbetskläder.

source: Clothes locker ventilation is desirable, especially for work clothing
sv: Ventilation i klädskåp är önskvärd särskilt för arbetskläder.

source: Clothes lockers should be dimensioned so that clothes can be hung on a coat hanger.
sv: Klädskåp bör ha sådana mått att kläder kan hängas på galge.

source: Where work so requires, a locker or cupboard may need to be 40 cm wide to accommodate bulky clothing.
sv: Där arbetet så kräver kan fack eller skåp behöva vara 40 cm breda eller bredare för utrymmeskrävande kläder.

source: In a cabin for personnel, each employee generally needs a clothes locker for personal clothing and a cupboard or locker for work clothing.
sv: I en personalbod behöver i allmänhet varje arbetstagare klädskåp för privata kläder och skåp eller fack för arbetskläder.

source: Corresponding storage spaces are normally also needed in those parts of the building which are used as personnel facilities during repair and maintenance work.
sv: Motsvarande förvaringsutrymmen behövs normalt också i de delar av en byggnad som utnyttjas som personalutrymmen vid reparationsoch underhållsarbete.
